Revit 2026 API

# ExportUtilsGetExportId(Subelement) Method

---

Retrieves the GUID representing the subelement in DWF and IFC export.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Guid GetExportId(
	Subelement subelement
)
```
```vb
Public Shared Function GetExportId (
	subelement As Subelement
) As Guid
```
```cpp
public:
static Guid GetExportId(
	Subelement^ subelement
)
```
```fsharp
static member GetExportId :
        subelement : Subelement -> Guid
```

#### Parameters

subelement Subelement
     The subelement.

#### Return Value

Guid The value of the GUID representing the subelement in the export context.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This id is used in the contents of DWF export and IFC export and it should be used only when cross-referencing to the contents of these export formats. When storing Ids that will need to be mapped back to subelements in future sessions, UniqueId must be used.

#### Reference

ExportUtils Class

GetExportId Overload

Autodesk.Revit.DB Namespace